app/Database/Migrations/2025-02-04-030621_CreateRolesTable.php

INSERT INTO `roles` (`created_at`, `name`)
VALUES ('2025-02-04 16:04:42','super_admin'), ('2025-02-04 16:04:42','hotel_owner'), ('2025-02-04 16:04:42','hotel_manager'), ('2025-02-04 16:04:42','staff'), ('2025-02-04 16:04:42','customer'), ('2025-02-04 16:04:42','housekeeping'), ('2025-02-04 16:04:42','front_office'), ('2025-02-04 16:04:42','kitchen')
---
            ['name' => 'front_office', 'created_at' => date('Y-m-d H:i:s')],
            ['name' => 'kitchen', 'created_at' => date('Y-m-d H:i:s')]
        ];
        $this->db->table('roles')->insertBatch($data);