app/Controllers/Hotel_owner.php

    public function role(){
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }

        $data['roles'] = $this->roleModel->findAll();
---
SELECT *
FROM `roles`

    public function user() {
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }

        $userData = $this->getUserDataFromSession();

        $data['users'] = $this->UHORelationModel
                                        ->select('users.*, roles.name as role_name')
                                        ->join('users', 'users.id = u_h_o_relation.user_id') // First join users table
                                        ->join('roles', 'roles.id = users.role_id') // Then join roles table
                                        ->join('hotels', 'hotels.id = u_h_o_relation.hotel_id') // Then join roles table
                                        ->get()
                                        ->getResultArray();
---
SELECT `users`.*, `roles`.`name` as `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `managers` ON `users`.`id` = `managers`.`user_id`
WHERE `users`.`id` = '12'
OR `managers`.`hotel_id` IN (SELECT id FROM hotels WHERE user_id = 12)

        }

        // Handle non-POST requests (i.e., load form view)
        $data['hotels'] = $this->hotelModel->where('user_id', $userData['id'])->findAll();
        $data['roles'] = $this->roleModel->findAll();
---
SELECT *
FROM `hotels`
WHERE `user_id` = '12'
SELECT *
FROM `roles`

    public function hotel(){
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }

        $userId = $this->getUserDataFromSession()['id']; // Assuming user_id is stored in session
        $data['hotels'] = $this->hotelModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `hotels`
WHERE `user_id` = '2'
AND `hotels`.`deleted_at` IS NULL