app/Controllers/Hotel_owner.php

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
AND `roles`.`id` = '4'
---
    public function edit_role($id){
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }

        $role = $this->roleModel->find($id);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '3'
SELECT *
FROM `u_h_o_relation`
WHERE `user_id` = '3'
AND `u_h_o_relation`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `users` SET `name` = 'Manohar Mohanta', `email` = 'manoharmohanta@rediffmail.com', `phone` = '9876541211', `role_id` = '3', `password` = '$2y$10$QdRlyzzizyPSJg6dn1seGe18sqslPf1syuKnfOabZhZwRjokZfoxq', `updated_at` = '2025-02-06 15:09:27'
WHERE `users`.`id` IN ('3')
---
    public function edit_user($id) {
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }

        $userData = $this->getUserDataFromSession();

        // Fetch user details
        $user = $this->userModel->find($id);
        if (!$user) {
            return redirect()->to(base_url($this->className . '/user'))->with('error', 'User not found.');
        }

        // Fetch user's hotel relation
        $userRelation = $this->UHORelationModel->where('user_id', $id)->first();

        if ($this->request->getMethod() === 'post' || $this->request->hasHeader('HX-Request')) {
            $data = [
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'phone' => $this->request->getPost('phone'),
                'role_id' => $this->request->getPost('role_id'),
            ];

            // Update password only if provided
            $password = $this->request->getPost('password');
            if (!empty($password)) {
                $data['password'] = password_hash($password, PASSWORD_DEFAULT);
            }

            $update = $this->userModel->update($id, $data);

UPDATE `u_h_o_relation` SET `hotel_id` = '6', `updated_at` = '2025-02-06 15:09:27'
WHERE `u_h_o_relation`.`id` IN ('1')
---
                // Update hotel-user relationship if hotel_id is changed
                $hotelId = $this->request->getPost('hotel_id');
                if ($userRelation && $hotelId != $userRelation['hotel_id']) {
                    $this->UHORelationModel->update($userRelation['id'], [
                        'hotel_id' => $hotelId
                    ]);

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
---

        // Fetch hotels and roles for the dropdowns
        $data['hotels'] = $this->hotelModel->where('user_id', $userData['id'])->findAll();
        $data['roles'] = $this->roleModel->findAll();

SELECT *
FROM `hotels`
WHERE `user_id` = '2'
AND `hotels`.`deleted_at` IS NULL
---
    public function room(){
        if (!$this->isUserLoggedIn()) {
            return redirect()->to(base_url('hotel/logout'));
        }
        if ($this->request->getMethod() === 'post' || $this->request->hasHeader('HX-Request')) {

        }
        $userId = $this->getUserDataFromSession()['id']; // Assuming user_id is stored in session
        $data['hotels'] = $this->hotelModel->where('user_id', $userId)->findAll();