app/Controllers/Hotel_owner.php

INSERT INTO `hotels` (`user_id`, `name`, `phone`, `email_id`, `address`, `created_at`, `updated_at`) VALUES (1, 'Hotel New 1', '8801005610', 'test@gmail.com', 'Test address', 0, '2025-02-05 20:33:45')
---
            ];

            // Insert data securely
            if ($this->hotelModel->insert($data)) {