app/Models/HotelModel.php

    public function getHotelsByUser($userId)
    {
        return $this->where('user_id', $userId)->findAll();
---
SELECT *
FROM `hotels`
WHERE `user_id` IS NULL