app/Models/UserModel.php

    public function loginUser($email, $password){
        $user = $this->select('users.*, roles.name as role_name')
                     ->join('roles', 'roles.id = users.role_id')
                     ->where('users.email', $email)
                     ->first();
---
SELECT `users`.*, `roles`.`name` as `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`email` = 'Manohar@idp.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1